
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщение () Экспорт
	
	Token = Константы.ВКМ_ТокенУправленияТБ.Получить();
	Chat_id = Константы.ВКМ_ИдентификаторГруппы.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УведомленияТВ.Текст,
		|	УведомленияТВ.Ссылка			
		|ИЗ
		|	Справочник.ВКМ_УведомленияТБ КАК УведомленияТВ";
		
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = Выборка.Текст;
		
		АдресТБ = "api.telegram.org";
		Соединение = Новый HTTPСоединение(АдресТБ, 443, , , , , Новый ЗащищенноеСоединениеOpenSSL( ));
		Данные = Новый Структура;
		Данные.Вставить("text", ТекстСообщения);
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить ("content-type", "application/json");
		АдресЗапроса = "bot" + Token +"/sendMessage?chat_id=" + Формат(Chat_id, "ЧГ=");
		Запрос = Новый HTTPЗапрос(АдресЗапроса,Заголовки);
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		Попытка
			Результат = Соединение.ОтправитьДляОбработки(Запрос);
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Удалить();
		Исключение
			ЗаписьЖурналаРегистрации(Нстр("ru = 'Выполнение операции'"),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОШибки(ИнформацияОбОшибке()));
		КонецПопытки;		
		
		Если Не Результат.КодСостояния = 200 Тогда
			ВызватьИсключение "Ошибка проверки связи";
		КонецЕсли;
			
		
	КонецЦикла;		
		

КонецПроцедуры	

#КонецОбласти
