
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщение () Экспорт
	
	Token = Константы.ВКМ_ТокенУправленияТБ.Получить();
	Chat_id = Константы.ВКМ_ИдентификаторГруппы.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УведомленияТВ.Текст,
		|	УведомленияТВ.Ссылка			
		|ИЗ
		|	Справочник.ВКМ_УведомленияТБ КАК УведомленияТВ";
		
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	АдресТБ = "api.telegram.org";
	Соединение = Новый HTTPСоединение(АдресТБ, 443, , , , , Новый ЗащищенноеСоединениеOpenSSL( ));
	МассивДляУдаления = Новый Массив;

	Пока Выборка.Следующий() Цикл

		Данные = Новый Структура;
		Данные.Вставить("text", Выборка.Текст);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		СтрокаJSON = ЗаписьJSON.Закрыть();

		Заголовки = Новый Соответствие;
		Заголовки.Вставить ("content-type", "application/json");
		АдресЗапроса = "bot" + Token + "/sendMessage?chat_id=" + Формат(Chat_id, "ЧГ=");
		ЗапросHTTP = Новый HTTPЗапрос(АдресЗапроса, Заголовки);
		ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаJSON);

		Попытка
			Результат = Соединение.ОтправитьДляОбработки(ЗапросHTTP);

			Если Результат.КодСостояния = 200 Тогда
				МассивДляУдаления.Добавить(Выборка.Ссылка);
			Иначе
				ЗаписьЖурналаРегистрации(
                "Ошибка отправки в Telegram: " + Результат.КодСостояния, УровеньЖурналаРегистрации.Ошибка, , ,
					ОбработкаОшибок.СообщениеОбОшибкеДляПользователя(ИнформацияОбОшибке()));
			КонецЕсли;

		Исключение
			ЗаписьЖурналаРегистрации(
            "Ошибка при отправке сообщения", УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.СообщениеОбОшибкеДляПользователя(
				ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
	Для Каждого СсылкаДляУдаления Из МассивДляУдаления Цикл
		Попытка
			Объект = СсылкаДляУдаления.ПолучитьОбъект();
			Объект.Удалить();
		Исключение
			ЗаписьЖурналаРегистрации(
            "Ошибка при удалении объекта", УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.СообщениеОбОшибкеДляПользователя(
				ИнформацияОбОшибке()));
		КонецПопытки;
КонецЦикла;	

КонецПроцедуры	

#КонецОбласти
