#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
	Сообщить("График заполнен");
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()
	СекундВСутках=60 * 60 * 24;
	МассивРабочихДней=Новый Массив(7);
	МассивРабочихДней[0]=Пн;
	МассивРабочихДней[1]=Вт;
	МассивРабочихДней[2]=Ср;
	МассивРабочихДней[3]=Чт;
	МассивРабочихДней[4]=Пт;
	МассивРабочихДней[5]=Сб;
	МассивРабочихДней[6]=Вс;
	КоличествоДней = (НачалоДня(Период.ДатаОкончания) - НачалоДня(Период.ДатаНачала)) / СекундВСутках;
	Для НомерДня = 0 По КоличествоДней Цикл
		ТекущаяДата=Период.ДатаНачала + СекундВСутках * НомерДня;
		Запись=РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьМенеджерЗаписи();
		Запись.ГрафикРаботы=График;
		Запись.Дата=ТекущаяДата;
		Запись.РабочийДень=?(МассивРабочихДней[ДеньНедели(ТекущаяДата) - 1], 1, 0);
		Запись.Записать();
	КонецЦикла;
КонецПроцедуры
#КонецОбласти