
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
 
 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РассчитатьОбщееКолДнейОтпуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РассчитатьОбщееКолДнейОтпуска();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	РассчитатьОбщееКолДнейОтпуска();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпуска


#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Команда1(Команда)

	Адрес = ПолучитьДанныеДляГрафикаНаСервере();

	Если Адрес = Неопределено Тогда
		Сообщить("Не удалось получить данные для анализа");
		Возврат;
	КонецЕсли;
	СтрутураПараметров = Новый Структура;
	СтрутураПараметров.Вставить("Адрес", Адрес);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", СтрутураПараметров, ЭтаФорма, );
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляГрафикаНаСервере()

	СтруктураОтпуска = Новый Структура;
	СтруктураОтпуска.Вставить("ДанныеДляГрафикаОтпусков", Объект.Отпуска.Выгрузить());
	Адрес=ПоместитьВоВременноеХранилище(СтруктураОтпуска, Новый УникальныйИдентификатор);
	Возврат Адрес;

КонецФункции
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

 &НаСервере
 Процедура РассчитатьОбщееКолДнейОтпуска()
 	
 	Для Каждого Строка Из Объект.Отпуска Цикл
		Строка.КоличествоДней = ВКМ_РаботаСОтпускамиВызовСервера.РассчитатьКоличествоДнейОтпуска(Объект.Ссылка,Строка.Сотрудник )
 	КонецЦикла;
 	
 КонецПроцедуры	

#КонецОбласти
