
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьНовыйДокумент(ТабАкты, Организация, Дата)Экспорт

	
	КолДок = ТабАкты.Количество();
	Сч=1;
	Для Каждого Договор Из ТабАкты Цикл

		Если ЗначениеЗаполнено(Договор.Реализация) Тогда
			Продолжить;
		КонецЕсли;

		НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НоваяРеализация.Дата = Дата ; //ТекущаяДата()
		НоваяРеализация.Договор = Договор.Договор;
		НоваяРеализация.ВыполнитьАвтозаполнение();
		НоваяРеализация.Контрагент = Договор.Контрагент;
		НоваяРеализация.Организация = Организация;
		НоваяРеализация.Комментарий = "Создано из обработки массовое создание актов";		
		Попытка
			НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			НоваяРеализация.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		ПроцентВыполнения = (Сч/КолДок)*100;
		ПроцентВыполнения = Окр(ПроцентВыполнения,0);
		Сч = Сч + 1;
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения);
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецЕсли
