
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервереБезКонтекста
Процедура ПостроитьДиаграммуГанта(ДанныеДляГрафика, ДиаграммаГанта)
    
    ТаблицаОтпусков = ДанныеДляГрафика.ДанныеДляГрафикаОтпусков;
    Серия = ДиаграммаГанта.УстановитьСерию("Отпуска");
  
   Для Каждого Строка Из ТаблицаОтпусков Цикл
   
   	Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник.Наименование);
   	Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
   	Интервал = Значение.Добавить();
   	Интервал.Начало = Строка.ДатаНачала;
   	Интервал.Конец = Строка.ДатаОкончания;
   
    КонецЦикла;	
   
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	ДанныеДляГрафика = ПолучитьИзВременногоХранилища(Параметры.Адрес);
    ПостроитьДиаграммуГанта(ДанныеДляГрафика, ДиаграммаГанта);
    ДиаграммаГанта.Обновление = Истина;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
