
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_Отпуска.Записывать = Истина;    
	Движения.ВКМ_Отпуска.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВКМ_Отпуска");  
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Отпуска;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник","Сотрудник"); 
	Блокировка.Заблокировать();
	
	ТекущиеДанные = Отпуска.Выгрузить();
	
	Для Каждого ТекСтрока Из ТекущиеДанные Цикл
		Движение = Движения.ВКМ_Отпуска.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		Движение.КоличествоДней = ( ТекСтрока.ДатаОкончания - ТекСтрока.ДатаНачала +1)/60/60/24;
	КонецЦикла;
	
	
	
	
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
