#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьРеквизитыДоговораАО();	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Группа = Элементы.Добавить("ГруппаРеквизитыАО",Тип("ГруппаФормы"), ЭтотОбъект);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "Реквизиты договора Абонентского обслуживания";
	
	НовыйЭлемент = Элементы.Добавить ("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"),Группа);
    НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
    НовыйЭлемент.Вид  = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент = Элементы.Добавить ("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"),Группа);
    НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
    НовыйЭлемент.Вид  = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент = Элементы.Добавить ("ВКМ_СуммаАП", Тип("ПолеФормы"),Группа);
    НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАП";
    НовыйЭлемент.Вид  = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент = Элементы.Добавить ("ВКМ_СтоимостьЧаса", Тип("ПолеФормы"),Группа);
    НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
    НовыйЭлемент.Вид  = ВидПоляФормы.ПолеВвода;
 
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидимостьРеквизитыДоговораАО();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидимостьРеквизитыДоговораАО()

	Если Объект.ВидДоговора = ПредопределенноеЗначение ("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ГруппаРеквизитыАО.Видимость = Истина;
	Иначе
		Элементы.ГруппаРеквизитыАО.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
